<?php

/*
|--------------------------------------------------------------------------
| 用户管理配置文件
|--------------------------------------------------------------------------
| 定义用户体系相关配置信息
|
*/
return [
    // 添加用户或者修改基本信息时，判断唯一的数据字段，键为字段名，值为中文描述
    'unique_field'          => [
        'email'     => '邮箱',
        'moble'     => '手机号',
    ],
    // 用于加密生成推荐码的数值
    'inviter_code'          => 651423,
    // 推荐码最高记录层级，0则全部记录
    'inviter_level_limit'   => 3,
    // 新增用户时，如未输入密码，默认的密码
    'default_password'      => '123456',
    // 注册时，是否强制要求填入邀请码(参数名：code)
    'forceInviteCode'       => false,
    // 注册用户默认status状态
    'register_user_status'  => 1,
    // 默认用户头像
    'default_avatar'        => '',
    // 用户登录后记录用户信息的session键名
    'session_key'           => 'user',
    // 登录失败次数限制
    'login_faild'           => [
        // 账号登录失败次数
        'account_error_limit'   => 5,
        // IP登录失败次数
        'ip_error_limit'        => 8,
        // 间隔时间多少分钟
        'login_gap'             => 5,
    ],
    // 开启单点登录
    'sign_in'               => true,
    // 开启单点登录后，仍可以多点登录的用户ID
    'sign_in_filter'        => [],
    // 用户等级
    'level'                 => ['普通用户', '白银用户', '黄金用户', '铂金用户', '钻石用户'],
    // 平台名称
    'platform'              => ['QQ', '微信', '百度', '支付宝', '淘宝', '微博', '抖音'],
];
